let teachers_info = [
  {
    id: 1,
    img: "img/teachers_about/director.jpg",
    name: "Нарзиқулова Гулчеҳра Камбаридиновна",
    who: "Самарқанд тумани  2-ихтисослаштирилган  давлат умумтаълим мактаби директори",
    thisdate: "1999 йил 01 ноябрдан:",
    borntime: "10.05.1961",
    bornplace: "Самарқанд вилояти, Самарқанд тумани",
    knowlege: "олий",
    knowpots: "йўқ",
    study: "1988 йил,Самарқанд давлат университети (кечки)",
    prof: "биология ўқитувчиси",
    information: `1988 - 1992 йй - Самарқанд вилояти Самарқанд давлат университети катта лаборанти
    1992 - 1999 йй - Самарқанд вилояти Самарқанд туман ҳокимлиги  етакчи мутахассиси
    1999 й  - х.в     - Самарқанд вилояти Самарқанд туманидаги 2 - ихтисослаштирилган давлат умумтаълим мактаби директори`
  },
  {
    id: 2,
    img: "img/teachers_about/zavuch.jpg",
    name: "Ҳалимова Зулфия Давроновна",
    who: "Самарқанд тумани  2-ихтисослаштирилган давлат умумтаълим мактаби ўқув ишлари бўйича директор ўринбосари",
    thisdate: "2012 йил 02 сентябрдан:",
    borntime: "17.03.1966",
    bornplace: "Самарқанд вилояти,Самарқанд тумани",
    knowlege: "олий",
    knowpots: "йўқ",
    study: "1989 йил. Самарқанд давлат университети (кечки)",
    prof: "кимё фан ўқитувчиси	",
    information: `1990 – 2012 йй - Самарқанд вилояти Самарқанд  туманидаги  2- ихтисослаштирилган давлат
    умумтаълим  мактаби кимё фан ўқитувчиси
  2012йй-ҳ/вгача - Самарқанд вилояти Самарқанд  туманидаги  2- ихтисослаштирилган давлат
    умумтаълим  мактаби ўқув ишлари бўйича директор ўринбосари`
  },
  {
    id: 3,
    img: "img/teachers_about/astanova.jpg",
    name: "Астанова Дилбар Зубайдовна",
    who: "Самарқанд тумани 2-умумтаълим мактаби  ўқув ва тарбиявий ишлар бўйича директор ўринбосари",
    thisdate: "2018 йил 5-сентябрдa",
    borntime: "25.07.1965-йил",
    bornplace: "Бухоро вилояти, Қоракўл тумани ",
    knowlege: "олий",
    knowpots: "йўқ",
    study: "1987й.  Самарқанд Давлат университети (кундузги)",
    prof: "химик,ўқитувчи",
    information: `1982-1987 йй.- Самарқанд Давлат  университети талабаси
    1988-2001 йй.- Самарқанд туман 1-ўрта мактаб кимё  фани ўқитувчиси
    1999-2005 йй.- Самарқанд шаҳар Темирйўл туман 41-ўрта мактаб кимё  фани ўқитувчиси
    2005-2018 йй.- Самарқанд Олий Ҳарбий Автомобил Қўмондонлик Муҳандислик билим юрти Табиий-илмий фанлар кафедраси катта ўқитувчиси
    2018 й.март.- Самарқанд тумани 6-умумтаълим мактаби кимё-биология ўқитувчиси
    2018 й-ҳ в.- Самарқанд тумани 2-умумтаълим мактаби ўқув ва тарбиявий ишлар бўйича директор ўринбосари`
  },
  {
    id: 5,
    img: "./img/teachers_about/baxtiyor teacher.jpg",
    name: "Ураков  Бахтиёр  Шукруллоевич",
    who: "Самарқанд тумани 2–ихтисослаштирилган давлат умумтаълим мактаби биология фани  ўқитувчиси",
    thisdate: "2017 йил 01 мартдан:",
    borntime: "03.11.1983",
    bornplace: "Самарқанд вилояти, Самарқанд тумани",
    knowlege: "олий",
    knowpots: "магистр",
    study: "2004 йил, Самарқанд давлат университети, биология факултети (кундузги)",
    prof: "Экология ва табиатдан фойдаланиш",
    information: `2004-2009 йй.-Самарқанд чинни буюмлар ишлаб чиқариш заводи ,Нафис”акционерлик жамиятида  назоратчи, қабул қилувчи, пиширувчи
    2009-2011 йй.- Самарқанд вилоят ,,Мевасабзавот таqёрлов савдо компаниясида тайёрлов ва транспорт бўлими бошлиги
    2013-2016 йй- Самарқанд шахар Маиший хизмат касб ҳунар коллежи ўқитувчиси
    2017 й   -ҳ.в.-Самарқанд тумани 2 – ихтисослаштирилган давлат умумтаълим мактабида `
  },
  {
    id: 4,
    img: "img/teachers_about/jasur teacher.png",
    name: "Номозов Жасур Бахтиёр ўғли",
    who: "Самарқанд тумани 2- ихтисослаштирилган  давлат умумтаълим мактаби информатика ўқитувчиси",
    thisdate: "2019 йил 4 сентябрдан:",
    borntime: "03.09.1995",
    bornplace: "Самарқанд вилояти, Самарқанд тумани",
    knowlege: "олий",
    knowpots: "йўқ",
    study: "2019 йил, TATU Samarqand filiali (kunduzgi)",
    prof: "informatika ўқитувчиси",
    information: `2019 й.   х.в   - Самарқанд туман халқ таълими бўлими тасарруфидаги 2- ихтисослашган давлат умумтаълим мактаби informatika фани ўқитувчиси`
  },
  {
    id: 6,
    img: './img/teachers_about/hamza teacher.jpg',
    name: "Аслиддинов Хамза Нуритдинович",
    who: "Самарканд тумани  2-ихтисослаштирилган давлат умумтаълим мактабининг жисмоний тарбия фани ўқитувчиси ",
    thisdate: "1992 йил 19 августдан:",
    borntime: "15.05.1968",
    bornplace: "Самарқанд вилояти, Самарқанд тумани",
    knowlege: "олий",
    knowpots: "йўқ",
    study: "1992 йил, Тошкент давлат жисмоний тарбия институти  (кундузги)",
    prof: "жисмоний тарбия  ўқитувчиси",
    information: `1992.й   х.в   - Самарқанд вилояти Самарқанд тумани 2-ихтисослаштирилган давлат умумтаълим мактабинингжисмоний тарбия фани ўқитувчиси`
  },
  {
    id: 7,
    img: "./img/teachers_about/gulchexra teacher.jpg",
    name: "Холова Гулчеҳра Нажмиддинова",
    who: "Самарқанд тумани 2-ихтисослаштирилган давлат умумтаълим мактаби она тили ва адабиёт фани ўқитувчиси.",
    thisdate: "2012 йил 02 сентябрдан:",
    borntime: "03.09.1989",
    bornplace: "Самарқанд вилояти, Тайлоқ тумани ",
    knowlege: "олий",
    knowpots: "йўқ",
    study: "2010 йил,Самарқанд  давлат университети (кундузги) ",
    prof: "она тили ва адабиёт ўқитувчиси ",
    information: `2006-2010 йй - Самарқанд Давлат университетининг талабаси.
    2010- 2012 йй - Самарқанд вилоят Тайлоқ туманига қарашли 16- мактабда ўқитувчи
    2012   й   х.в - Самарқанд туманидаги 2-ихтисослаштирилган давлат умумий ўрта таълим мактабининг она тили ва адабиёт фан ўқитувчиси`
  },
  {
    id: 8,
    img: "img/teachers_about/iroda teacher.jpg",
    name: "Уракова Ирода Шукруллоевна",
    who: "Самарқанд тумани 2-ихтисослаштирилган давлат умумтаълим мактаби бошланғич синф ўқитувчиси",
    thisdate: "2018 йил 03сентябрдан:",
    borntime: "25.04.1982",
    bornplace: "Самарқанд вилояти, Самарқанд тумани",
    knowlege: "олий",
    knowpots: "йўқ",
    study: "2008 йил, Самарқанд давлат университети(сиртқи)",
    prof: "педагогика ва психология",
    information: `2000-2002.йй - Самарқанд Абу Райхон Беруний номидаги  педагогика билим юрти
    2004-2008.йй - Самарқанд давлат университети 
    2016-2018.йй - Самарқанд тумани 2-ихтисослаштирилган давлат умумтаълим мактабида амалиётчи психолог лавозими
    2018.йй.   х.в - Самарқанд тумани 2-ихтисослаштирилган давлат умумтаълим мактабида бошлангич синф ўқитувчиси`
  },
  {
    id: 9,
    img: "img/teachers_about/nigina teacher.jpg",
    name: "Шодмонова Нигина Фуркатовна",
    who: "Самарканд тумани 2-умумий ўрта таълим мактабида рус тили ва адабиёти фаниўқитувчиси",
    thisdate: "2014йил 2 сентябрдан: ",
    borntime: "08.07.1988",
    bornplace: "Самарканд вилояти, Самарканд тумани",
    knowlege: "олий",
    knowpots: "йўқ",
    study: "2010 йил,Самарқанд давлат университети(кундузги)",
    prof: "Филолог, славян филологияси",
    information: `2006-2010 йй - Самарқанд Давлат Университети талабаси
    2009-2012 йй - Самарқанд туманидаги 2- ихтисослаштирилган давлат умумтаълим мактабининг  рус тили ва адабиёти фани ўқитувчиси
    2013-2014 йй - Самарқанд.туманидаги 36 –умумий зрта таълим мактабининг рус тили ва адабиёти фани ўқитувчиси
    2014 й.-ҳ.в    - Самарқанд туманидаги 2-умумий ўрта таълим мактабининг  рус тили ва адабиёти фани ўқитувчиси`
  },
  {
    id: 10,
    img: "img/teachers_about/gulmira teacher.jpg",
    name: "Шодиева Гулмира Усмоновна",
    who: "Самарканд тумани 2-ихтисослаштирилган давлат умумтаълим мактаби бошланғич таълим фан ўқитувчиси ",
    thisdate: "2002  йил 2 сентябрдан:",
    borntime: "17.02.1981",
    bornplace: "Самарканд вилояти ,Самарканд тумани",
    knowlege: "олий",
    knowpots: "йўқ",
    study: "2004 йил, Самарқанд давлат университети(кундузги)",
    prof: "бошланғич синф ўқитувчиси",
    information: `1997-2001 йй. - Самарқанд педагогика билим юрти талабаси
    1999-2002 йй. - Самарқанд туманидаги 6-умумий ўрта таълим мактабининг котибаси
    2001-2004 йй. - Самарқанд давлат университети талабаси
    2002-2006 йй.  - Самарқанд тумани 2-умумий ўрта таълим мактабида лаборант
    2006 й.   ҳ.в   - Самарқанд тумани 2-ихтисослаштирилган давлат умумтаълим мактабида бошланғич синф ўқитувчиси`
  },
  {
    id: 11,
    img: "img/teachers_about/nasiba teacher.jpg",
    name: "Шермухамедова Насиба Собировна",
    who: "Самарқанд тумани 2-ихтисослаштирилган давлат умумтаълим мактаби рус тили ва адабиёти фан ўқитувчиси",
    thisdate: "2015 йил 02 сентябрдан:",
    borntime: "14.08.1972",
    bornplace: "Самарқанд вилояти, Самарқан тумани",
    knowlege: "олий",
    knowpots: "йўқ",
    study: "1994 йил, Самарқанд  давлат  университети (кундузги)",
    prof: "рус тили ва адабиёти ўқитувчиси",
    information: `1989-1994йй.- Самарқанд давлат университети талабаси
    1994-2010йй.- Самарқанд  тумани 2-ихтисослаштирилган давлат умумтаълим мактабининг рус тили ва адабиёти фани ўқитувчиси
    2015-2020 й.   х.в   .- Самарқанд тумани 2-ихтисослаштирилган давлат умумтаълим мактабининг  рус тили ва адабиёти фани ўқитувчиси`
  },
  {
    id: 12,
    img: "img/teachers_about/sanobar teacher.png",
    name: "Саттарова Санобар Рашидовна",
    who: "Самарқанд тумани 2-ихтисослаштирилган давлат умумтаълим мактаби бошланғич синф ўқитувчиси",
    thisdate: "2001 йил 01 августдан:",
    borntime: "02.01.1981",
    bornplace: "Самарқанд вилояти, Самарқанд тумани",
    knowlege: "олий",
    knowpots: "йўқ",
    study: "2001йил,Самарканд давлат университети (кундузги)",
    prof: "Бошланғич синф ўқитувчиси",
    information: `1997-2001йй.-Самарқанд давлат университети талабаси
    2001 й.   ҳ.в   - Самарканд тумани 2-ихтисослаштирилган давлат умумтаълим мактабида бошланғич синф ўқитувчиси `
  },
  {
    id: 13,
    img: "img/teachers_about/sattorova teacher.jpg",
    name: "Сатторова Мухаббат Мажидовна ",
    who: "Самарканд тумани 2-ихтисослаштирилган давлат умумтаълим мактаби инглиз тили фан  ўқитувчиси ",
    thisdate: "2001 йил 1 сентябрдан:",
    borntime: "08.05. 1976",
    bornplace: "Самарканд вилояти,Самарқанд туман",
    knowlege: "олий",
    knowpots: "йўқ",
    study: "2001 йил, Самарканд давлат чет тиллар институти (кундузги)",
    prof: "инглиз тили ўқитувчиси",
    information: `1996-1997.йй Самарканд Давлат Чет Тиллар институтида кутубхоначи вазифасида
    2001   й.х.в   - Самарканд тумани 2-ихтисослаштирилган давлат умумий ўрта таълим мактабида инглиз тили фан ўқитувчиси `
  },
  {
    id: 14,
    img: "img/teachers_about/saidova nigina teacher.jpg",
    name: " Саидова Нигина Абдугафоровна",
    who: "Самарқанд тумани 2-ихтисослаштирилган давлат умумий ўрта таълим мактаби тарих фани ўқитувчиси",
    thisdate: "2018 йил 1 апрелдан:",
    borntime: "21.09.1986",
    bornplace: "Самарқанд вилояти, Самарқанд тумани",
    knowlege: "олий",
    knowpots: "йўқ",
    study: "2008 йил, Самарқанд Давлат университети (кундузги)",
    prof: "тарих фан ўқитувчиси",
    information: `2004-2008 йй.- Самарқанд Давлат университети талабаси
    2008-2012 йй.- Самарқанд шаҳар 1-сон педагогика коллежи тарих фани ўқитувчиси
    2012-2018 йй.- Самарқанд шаҳар Транспорт ва коммунал касб-ҳунар коллежи тарих фани ўқитувчиси
    2018 й   ҳ.в   - Самарқанд тумани 2-умумтаълим мактаби тарих фани ўқитувчиси`
  },
  {
    id: 15,
    img: "img/teachers_about/qodirova nasiba teacher.jpg",
    name: "Кадирова Насиба Мардоновна",
    who: "Самарканд тумани 2-ихтисослаштирилган давлат умумтаълим мактаби рус тили ва адабиёти фани  ўқитувчиси",
    thisdate: "2011  йил 2 сентябрдан:",
    borntime: "05.11.1966",
    bornplace: "Cамарканд вилояти, Самарканд шахри",
    knowlege: "олий",
    knowpots: "йўқ",
    study: "1990 йил, Самарқанд давлат университети (кундузги)",
    prof: "Филолог",
    information: `1983-1992 йй. - Бошғишамол туманидаги Суғурта компанияси ишчиси
    1992-1993  йй. - УТҲБЮ да рус тили ўқитувчиси
    1993-2003 йй. - Самарқанд.шаҳридаги 16-умумий ўрта таълим мактабининг рус тили фани ўқитувчиси
    2003-2007 йй. - Самарқанд туманидаги 1- умумий ўрта таълим мактабининг рус тили фани ўқитувчиси
    2011 й.   ҳ.в.   - Самарканд туманидаги 2-ихтисослаштирилган давлат умумтаълим мактабининг рус тили ва адабиёти фан ўқитувчиси`
  },
  {
    id: 16,
    img: "img/teachers_about/dilfuza Teacher.jpg",
    name: "Қобилова Дилфуза Холмаматовна",
    who: "Самарқанд тумани 2- ихтисослашган давлат умумтаълим мактабининг бошланғич синф ўқитувчиси",
    thisdate: "2018 йил 03 сентябрдан:",
    borntime: "27.07.1970",
    bornplace: "Самарқанд вилояти, Самарқанд тумани",
    knowlege: "олий",
    knowpots: "йўқ",
    study: "1992 й. Самарқанд давлат педагогика институти (кундузги)",
    prof: "бошланғич синф ўқитувчиси",
    information: `1987-1994 йй. – Самарқанд шаҳридаги 100-болалар боғчасида тарбиячи
    1994-2017 йй. - Самарқанд туман халқ таълими муассасалари фаолиятини методик таъминлаш ва ташкил этиш бўлими тасарруфидаги 2- ихтисослашган  умумтаълим мактаби бошланғич таълим фани ўқитувчиси
    2018   ҳ.в   - Самарқанд туман халқ таълими муассасалари фаолиятини методик таъминлаш ва ташкил этиш бўлими тасарруфидаги  2- ихтисослашган  умумтаълим мактаби бошланғич таълим фан ўқитувчиси`
  },
  {
    id: 17,
    img: "img/teachers_about/barno teacher.jpg",
    name: "Кандахарова Барно Жамоловна",
    who: "Cамарканд тумани 2-ихтисослаштирилган давлат умумтаълим мактабида она тили ва адабиёт фани ўқитувчиси",
    thisdate: "2012 йил 02 сентябрдан:",
    borntime: "26.07.1989",
    bornplace: "Самарқанд вилояти, Каттақўрғон тумани ",
    knowlege: "олий",
    knowpots: "йўқ",
    study: "2012 йил,Самарқанд давлат университети (кундузги)",
    prof: "ўзбек филологияси",
    information: `2012 й.х.в - Самарқанд туманидаги 2-ихтисослашган давлат умумтаълим мактабида она тили ва адабиёт ўқитувчиси`
  },
  {
    id: 18,
    img: "img/teachers_about/Odilova teacher.jpg",
    name: "Одилова Инобат Мажидовна",
    who: "Самарқанд тумани 2-ихтисослаштирилган давлат умумтаълим мактаби инглиз тили фани ўқитувчиси ",
    thisdate: "2002 йил 02 сентябрдан:",
    borntime: "13.10.1977",
    bornplace: "Самарканд вилояти, Самарканд тумани",
    knowlege: "олий",
    knowpots: "йўқ",
    study: "2000 йил, Самарқанд давлат чет тиллар институт(кундузги)",
    prof: "инглиз тили фани ўқитувчиси",
    information: `2002 й. х.в  - Самарканд туманидаги  2-ихтисослаштирилган давлат умумтаълим мактабида  инглиз тили фан ўқитувчиси`
  },
  {
    id: 19,
    img: "img/teachers_about/shoxsanam teacher.jpg",
    name: "Насриддинова Шохсанам Туракуловна",
    who: "Самарқанд тумани 2-ихтисолаштирилган давлат умумтаълим мактаби бошланғич таълим фани ўқитувчиси",
    thisdate: "2007 йил 15 августдан:",
    borntime: "23.09.1977",
    bornplace: "Самарқанд вилояти,Самарқанд тумани ",
    knowlege: "олий",
    knowpots: "йўқ",
    study: "1999 йил, Самарқанд қишлоқ хўжалик институти(кундузги) 2019 йил ,Самарканд давлат университети( кундузги)",
    prof: "ветеринария, биология",
    information: `1993-1995 йй. - Самарқанд кимё заводи ошхонасида  ошпаз ёрдамчиси
    1995-1999 йй. - Самарқанд қишлоқ хўжалик институти  талабаси
    2002-2005 йй. - Самарқанд қишлоқ хўжалик институтида қорамолчилик ва йилқичилик кафедраси 
    лаборанти
    2006-2007 йй - Самарқанд туман Маиший  касб  - ҳунар  коллежида  психолог  
    2007-2017.йй - Самарқанд  туман 2-ихтисослаштирилган давлат умумтаълим мактабида биология фани 
    ўқитувчиси
    2017.й       х.в - Самарқанд  туман 2-ихтисослаштирилган давлат умумтаълим мактабида бошланғич таълим
    фани ўқитувчиси`
  },
  {
    id: 20,
    img: "img/teachers_about/manzura teacher.jpg",
    name: "Мирзаева Манзура Ботировна",
    who: " Самарқанд тумани 2-ихтисослаштирилган давлат умумтаълим мактаби бошланғич синф ўқитувчиси",
    thisdate: "2018 йил 3-сентябрдан:",
    borntime: "07.10.1984",
    bornplace: "Самарқанд вилояти, Қўшробот тумани",
    knowlege: "олий",
    knowpots: "йўқ",
    study: "2005йил, Самарқанд Давлат университети (кундузги)",
    prof: "бошланғич таълим ва тарбиявий иш",
    information: `2005-2009.йй - Самарқанд вилоят Қўшрўбот тумани 41-мактабда бошланғич синф ўқитувчиси 
    2009-2013.йй - Самарқанд вилоят Қўшрўбот тумани 19-мактабда бошланғич синф ўқитувчиси
    2018.й.х.в.     - Самарқанд шаҳар 2-ихтисослаштирилган давлат умумтаълим мактаб бошланғич синф ўқитувчиси`
  },
  {
    id: 21,
    img: "img/teachers_about/dilnoza teacher.jpg",
    name: "Махмудова Дилноза Фурқатовна ",
    who: "Самарқанд тумани 2-ихтисослаштирилган давлат умумтаълим мактаби бошланғич таълим фан ўқитувчиси",
    thisdate: "2010 йил 15 ноябрдан:",
    borntime: "18.07.1989",
    bornplace: "Самарканд вилояти ,Самарканд тумани",
    knowlege: "олий",
    knowpots: "йўқ",
    study: "2010 йил, Самарқанд  давлат университети",
    prof: "бошланғич таълим ва спорт тарбиявий иши",
    information: `2006-2010.йй - Самарқанд давлат университети талабаси
    2010-2015.йй - Самарқанд туманидаги 2-ихтисослаштирилган давлат умумтаълим мактабининг тўгарак раҳбари
    2015 й.  х.в     - Самарканд туманидаги 2-ихтисослаштирилган давлат умумтаълим мактабининг бошланғич синф ўқитувчиси`
  },
  {
    id: 22,
    img: "img/teachers_about/izzat teacher.jpg",
    name: "Мамаражабов Иззат Фарҳод ўғли ",
    who: "Самарқанд тумани 2-ихтисослаштирилган давлат умумтаълим мактаби жисмоний тарбия ўқитувчиси",
    thisdate: "2017 йил 2 сентябрдан:",
    borntime: "22.01.1992",
    bornplace: "Самарканд вилояти, Самарканд тумани",
    knowlege: "ўрта махсус",
    knowpots: "йўқ",
    study: "2011 йил, Самарқанд олимпия захираси коллежи",
    prof: "мураббий, спортнинг самбо кураши бўйича мураббий",
    information: `2008-2011.йй - Самарқанд олимпия захираси коллежи талабаси
    2011-2012 йй - Самарқанд туманидаги 5-умумий ўрта таълим мактабининг жисмоний тарбия фани ўқитувчиси
    2012-2013 йй - Самарқанд утманидаги 9-умумтаълим мактабининг жисмоний тарбия фан ўқитувчиси
    2013-2014 йй - Самарканд туманидаги 2-ихтисослаштирилган давлат умумтаълим мактабининг жисмоний тарбия фан ўқитувчиси
    2015-2017 йй - Самарканд туманидаги 2-ихтисослаштирилган давлат умумтаълим мактабининг: жисмоний тарбия тўгарак раҳбари
    2017.й.х.в       - Самарканд туманидаги 2-ихтисослаштирилган давлат умумтаълим мактабининг жисмоний тарбия  ўқитувчиси`
  },
  {
    id: 23,
    img: "img/teachers_about/begzod teacher.jpg",
    name: "Мамаражабов Бекзод Ўрозали ўғли",
    who: "Самарқанд тумани 2-ихтисослаштирилган давлат умумтаълим мактаби география фани ўқитувчиси",
    thisdate: "2017 йил 02 сентябрдан:",
    borntime: "01.09.1993",
    bornplace: "Самарқанд вилояти, Булунғур тумани",
    knowlege: "олий",
    knowpots: "йўқ",
    study: "2017 йил, Самарқанд давлат университети (кундузги)",
    prof: "география ўқитувчиси",
    information: `2013-2017йй. - Самарқанд давлат университети талабаси
    2017.й.    х.в  -.Самарқанд туманидаги 2-ихтисослаштирилган давлат умумий ўрта тълим мактабининг география ўқитувчиси`
  },
  {
    id: 24,
    img: "img/teachers_about/kamolova teacher.jpg",
    name: "Камолова Дилором  Нуритдиновна",
    who: "Самарканд тумани 2-ихтисослаштирилган давлат таълим мактаби кимё фани ўқитувчиси ",
    thisdate: "1992 йил 2 сентябрдан:",
    borntime: "14.04. 1968",
    bornplace: "Самарқанд вилояти, Самарқанд тумани",
    knowlege: "Олий",
    knowpots: "йўқ",
    study: "1990 йил, Самарканд Давлат Университети  (кундузги)",
    prof: " химик, ўқитувчи",
    information: `1985-1990 йй. - Самаркaнд Давлат Университети талабаси
    1990 –1992 йй. - Самаркaнд Давлат Университети кичик илмий ходими
    1992- 2014 йй. - Самарканд тумани 2-ихтисослаштирилган давлат умум таълим мактабида кимё фани ўқитувчиси
    2014- 2016 йй. - Самарқанд тумани 2-ихтисослаштирилган давлат умумий ўрта таълим мактабида ўқув ишлари бўйича директор ўринбосари
    2016 й.   ҳ.в   - Самарқанд тумани 2-ихтисослаштирилган давлат умум таълим мактабида кимё фани ўқитувчиси`
  },
  {
    id: 25,
    img: "img/teachers_about/sarvinoz teacher.png",
    name: "Ибрагимова Сарвиноз Абдумаликовна",
    who: "Самарканд туманидаги 2-ихтисослаштирилган давлат умумий урта таълим мактабида  бошланғич таълим фани ўқитувчиси ",
    thisdate: "2012 йил 02 сентябрдан:",
    borntime: "17.09.1988",
    bornplace: "Самарканд вилояти ,Самарканд туман",
    knowlege: "олий",
    knowpots: "йўқ",
    study: "2012йил,Самарқанд Давлат Университети (кундузги)",
    prof: "Бошланғич синф ўқитувчиси",
    information: `2008 й- 2012 йй. - Самарканд Давлат университета талабаси
    2012 й- 2013 й-    Самарканд туман 2-ИДУМда етакчи
   2013 й-2015 й –    Ҳомиладорлик таътилида
   2015 й-2017 й.-     Самарканд туман 2-ихтисослаштирилган Давлат умумтаълим
                                жисмоний тарбия  фан ўқитувчиси
   2017 й-ҳ/в сентябрдан  Самарканд туман 2-ихтисослаштирилган Давлат умумтълим
   Бошланғич таълим фан ўқитувчиси`
  },
  {
    id: 26,
    img: "img/teachers_about/hulkar teacher.jpg",
    name: "Холова Ҳулкарой Асрор қизи",
    who: "Самарканд тумани  2-ихтисослаштирилган давлат умумтаълим мактаби расм  ва чизмачилик фани ўқитувчиси",
    thisdate: "2015  йил 02 сентябрдан:",
    borntime: "09.10.1980",
    bornplace: "Самарканд вилояти ,Самарканд тумани",
    knowlege: "олий ",
    knowpots: "йўқ",
    study: "2011 йил,  Самарқанд  давлат университети(кундузги)",
    prof: "тасвирий санъат ва чизмачилик ўқитувчиси",
    information: `1999-2014.йй.  - Самарқанд туман 2-ихтисослаштирилган давлат умум таълим мактабда тасвирий санъат ўқитувчиси
    2009-2011.йй.  - Самарқанд давлат университети талабааси
    2015 й.   х.в     - Самарканд туманидаги 2-ихтисослаштирилган давлат умумтаълим мактабда тасвирий санъат ва чизмачилик ўқитувчиси`
  },
  {
    id: 27,
    img: "img/teachers_about/sayora teacher.jpg",
    name: "Хайитова Сайёра Фурқатовна",
    who: "Самарканд тумани 2-ихтисослаштирилган давлат умумтаълим мактаби инглиз тили фани ўқитувчиси",
    thisdate: "2013 йил 02 сентябрдан:",
    borntime: "02.01.1991",
    bornplace: "Самарқанд вилояти ,Самарканд шаҳри",
    knowlege: "олий",
    knowpots: "йўқ",
    study: "2013 йил,Самарқанд давлат чет тиллар институти (кундузги)",
    prof: "инглиз тили фани ўқитувчиси",
    information: `2013 й.  х.в  - Самарқанд туман 2-ихтисослаштирилган давлат умумтаълим мактаби инглиз тили фани ўқитувчиси`
  },
  {
    id: 28,
    img: "img/teachers_about/gulhayo teacher.jpg",
    name: "Hayitova Gulhayo Nurqobilqizi",
    who: "Samarqand tumani xalq ta'lim bo'limi tasarrufidagi 2- umumiy o'rta ta'lim maktabi fizika fani o'qituvchisi",
    thisdate: "2020 yil 11-yanvardan ",
    borntime: "24.04.1991",
    bornplace: "Samarqand viloyati, Ishtixon tumani",
    knowlege: "олий",
    knowpots: "йўқ",
    study: "2016 y. Samarqand davlat universiteti (bakalavriat)",
    prof: "fizik",
    information: `2012 - 2016 yy. - 
    Samarqand davlat universiteti  fizika fakulteti talabasi
    2016 - 2019yy. - 
    Samarqand shahar 22- maktab fizika fani o'qituvchisi
    2020y-h.v- Samarqand tumani xalq ta'lim bo'limi tasarrufidagi 2- umumiy o'rta ta'lim maktabi fizika fani o'qituvchisi`
  },
  {
    id: 30,
    img: "img/teachers_about/xurshida.jpg",
    name: "Газиева Хуршида Баходировна",
    who: "Самарқанд тумани 2-умумий ўрта таълим мактаби бошланғич синф ўқитувчиси",
    thisdate: "2018 йил 3 сентябрдан:",
    borntime: "19.12.1985",
    bornplace: "Самарқанд вилояти, Самарқанд шаҳари ",
    knowlege: "олий",
    knowpots: "йўқ",
    study: "2010 йил, Самарқанд Давлат университети (кундузги)",
    prof: "мактабгача талим ва болалар спорти",
    information: `2004-2005. йй - Самарқанд вилоят халқ талим бошқармасида электрон ҳисоблаш машинаси оператори
    2005-2006 йй - Самарқанд вилоят болалар ижодиёт саройида тўгарак раҳбари
    2010-2015 йй - Самарқанд вилоят болалар ижодиёт саройида тўгарак раҳбари
    2015-2018 йй - Самарқанд тумани 2-умумий ўрта таълим мактабида котиба
    2018 й.   х.в.   - Самарқанд тумани 2-умумий ўрта таълим мактаби бошланғич синф ўқитувчиси `
  },
  {
    id: 31,
    img: "img/teachers_about/kubaro teacher.jpg",
    name: "Бердиева Кубаро Хамракуловна",
    who: "Самарқанд тумани 2- ихтисослаштирилган  давлат умумтаълим мактаби рус тили фани ўқитувчиси ",
    thisdate: "2019 йил 1 ноябрдан:",
    borntime: "22.10.1972",
    bornplace: "Самарқанд вилояти, Самарқанд тумани ",
    knowlege: "олий",
    knowpots: "йўқ",
    study: "1996 йил, Самарқанд давлат университети (кечги)",
    prof: "рус тили филологияси ",
    information: `1991-1997 йй.- Самарқанд шахар “Марказий кутубхона” сида кутубхоначи лавозимида.
    1997-2002 йй.- Самарқанд шахар 41-ўрта таълим мактабида рус тили ўқитувчиси.
    2004-2012 йй.- Самарқанд туман халқ таълими бўлимига қарашли 22-сон Мактабгача таълим муасасаси рус тили ўқитувчиси.
    2019 й.   х.в   - Самарқанд туман 2- ихтисослашган давлат умумтаълим мактаби рус тили фани ўқитувчиси`
  },
  {
    id: 32,
    img: "img/teachers_about/nargiza teacher.jpg",
    name: "Бахриддинова Наргиза Неъматовна",
    who: "Самарқанд тумани 2-ихтисослаштирилган давлат умумтаълим мактабининг инглиз тили фани ўқитувчиси",
    thisdate: "2014 йил 02 сентябрдан: ",
    borntime: "12.11.1983",
    bornplace: "Қашқадарё вилояти,Китоб тумани",
    knowlege: "олий",
    knowpots: "йўқ",
    study: "2006 йил,Тошкент давлат педагогика институти (кундузги)",
    prof: "инглиз тили ва адабиёти",
    information: `2002-2006 йй - Тошкент давлат педагогика институти талабаси
    2006-2014 йй - Китоб туманидаги 21-умумий ўрта таълим мактабининг инглиз тили фани ўқитувчиси
    2014 й.  х.в    - Самарқанд туманидаги 2-ихтисослаштирилган давлат умумтаълим мактабининг инглиз тили фан ўқитувчиси`
  },
  {
    id: 33,
    img: "img/teachers_about/akmal teacher.png",
    name: "Баҳодиров Акмал Азамат ўғли",
    who: "Самарқанд тумани 2- ихтисослаштирилган  давлат умумтаълим мактаби инглиз тили фани ўқитувчиси ",
    thisdate: "2019 йил 02 сентябрдан: ",
    borntime: "23.09.1996",
    bornplace: "Самарқанд вилояти, Самарқанд тумани ",
    knowlege: "олий",
    knowpots: "йўқ",
    study: "2019 йил, Самарқанд давлат чет тиллар институти (кундузги)",
    prof: "ингилиз тили ўқитувчиси",
    information: `2019 й. х.в  - Самарқанд туман халқ таълими бўлими тасарруфидаги 2- ихтисослашган давлат умумтаълим мактаби инглиз тили ўқитувчиси`
  },
  {
    id: 34,
    img: "img/teachers_about/marziya teacher.jpg",
    name: "Баротова Марзия Абдуазизовна",
    who: "Самарканд тумани 2-ихтисослаштирилган давлат умумий ўрта таълим мактаби бошланғич синф укитувчиси",
    thisdate: "2017 йил 2 сентябрдан:",
    borntime: "08.09.1986",
    bornplace: "Самарқанд вилоят,Самарканд шахри",
    knowlege: "олий",
    knowpots: "йўқ",
    study: "2011 йил, Самарканд давлат университети (кундузги)",
    prof: "Бошлангич таълим ва спорт тарбиявий иш",
    information: `2005-2007 йй. - Самарканд давлат университети ректорати иш юритувчи котиба лавозимига
    2007-2011 йй. - Самарканд давлат университети педагогика факултети талабаси
    2014-2015 йй. - Самарканд давлат университети ректорати иш юритувчи котиба лавозимига
    2015-2017 йй. - Самарканд туман 9-умумтаълим мактаб, бошлангич синф укитувчиси 
    2017 й.   х в.    - Самарканд тумани 2-ихтисослаштирилган давлат умумий ўрта таълим 
    мактаби бошланғич синф укитувчиси`
  },
  {
    id: 35,
    img: "img/teachers_about/amonova.png",
    name: "Амонова Гулбаҳор Хурамовна",
    who: "Самарқанд тумани 2- ихтисослаштирилган  давлат умумтаълим мактаби тарих фани ўқитувчиси ",
    thisdate: "1991 йил 2 сентябрдан:",
    borntime: "28.09.1970",
    bornplace: "Самарқанд вилояти, Самарқанд тумани ",
    knowlege: "олий",
    knowpots: "йўқ",
    study: "1994 йил, Самарқанд давлат университети (кечки)",
    prof: "тарих ўқитувчиси",
    information: `1990-1991 йй.- Самарқанд туман халқ таълими бўлимига қарашли 2-ўрта мактаб кутубхона мудираси 
    1991-2007 йй.- Самарқанд туман халқ таълими бўлимига қарашли 2-ўрта мактаб тарих фани  ўкитувчиси 
    2007-2014 йй.- Самарқанд туман халқ таълими бўлимига қарашли 2- ихтисослашган  давлат умумтаълим мактаби ўқув ишлари бўйича директор ўринбосари 
    2014 й.   х.в   - Самарқанд туман халқ таълими муассасалари фаолиятини методик таъминлаш ва ташкил этиш бўлими тасарруфидаги 2- ихтисослашган давлат умумтаълим мактаби тарих фани ўқитувчиси
    `
  },
  {
    id: 36,
    img: "img/teachers_about/alibaeva teacher.jpg",
    name: "Алибаева Азиза Олимжоновна",
    who: "Самарқанд туманидаги 2-ихтисослаштирилган давлат умумтаълим мактабининг физика фани ўқитувчиси ",
    thisdate: "2019 йил 02 сентябрдан ",
    borntime: "03.08.1988",
    bornplace: "Самарканд вилояти, Жомбой тумани",
    knowlege: "Олий",
    knowpots: "йўқ",
    study: "2011 йил, Самарканд давлат университети (кундузги)",
    prof: "физика ўқитувчиси",
    information: `2007-2011йй. - Самарқанд давлат университети талабаси 
    2010-2012йй. - Самарқанд вилоят Жомбой туманидаги 45-умумий ўрта таълим мактабиининг физика ўқитувчиси
    2016-2017йй. - Самарканд туманидаги  2-ихтисослаштирилган давлат умумтаълим мактабининг физика фан ўқитувчи
    2019-ҳв. - Самарканд туманидаги  2-ихтисослаштирилган давлат умумтаълим мактабининг физика фан ўқитувчи`
  },
  {
    id: 37,
    img: "img/teachers_about/jurabek teacher.png",
    name: "Абдулфайзиев Журабек Каримович",
    who: "Самарқанд тумани 2- ихтисослаштирилган  давлат умумтаълим мактаби миллий истиқлол ғояси ва манавият асослари фани ўқитувчиси ",
    thisdate: "2019 йил  02 сентябрдан:",
    borntime: "16.02.1994",
    bornplace: "Самарқанд вилояти, Самарқанд тумани ",
    knowlege: "олий",
    knowpots: "йўқ",
    study: "2019 йил, Самарқанд давлат университети (кундузги)",
    prof: "миллий истиқлол ғояси манавият асослари ",
    information: `2019 й.   х.в   - Самарқанд туман халқ таълими  бўлими тасарруфидаги 2- ихтисослаштирилган давлат умумтаълим мактаби миллий истиқлол ғояси фани ўқитувчиси`
  },
  {
    id: 38,
    img: "img/teachers_about/zarnigor teacher.jpg",
    name: "Абдукаримова Зарнигор Абдукаримовна",
    who: "Самарқанд тумани 2-ихтисослаштирилган давлат умумтаълим мактаби инглиз тили фани ўқитувчиси",
    thisdate: "2012 йилдан 12 ноябрдан:",
    borntime: "27.01.1989",
    bornplace: "Самарқанд вилояти,Самарқанд тумани",
    knowlege: "олий",
    knowpots: "йўқ",
    study: "2011 йил, Самарқанд давлат чет тиллар институти (кундузги)",
    prof: "филолог, инглиз тили фани ўқитувчиси",
    information: `2011-2012 йй - Самарқанд тумани 6-умумий ўрта таълим мактаби инглиз тили фани ўқитувчиси
    2012 й. х.в - Самарқанд тумани 2-ихтисослаштирилган давлат умумтаълим мактаби инглиз тили фани ўқитувчиси`
  },
  {
    id: 39,
    img: "img/teachers_about/nilufar teacher.jpg",
    name: "Абдукаримова Нилуфар Абдукаримовна",
    who: "Самарқанд иқтисодиёт ва сервис институти академик лицейи инглиз тили фани ўқитувчиси",
    thisdate: "2011 йил 2 сентябрдан:",
    borntime: "06.04.1987",
    bornplace: "Самарқанд тумани",
    knowlege: "олий",
    knowpots: "йўқ",
    study: "2008 й. Самарқанд давлат чет тиллар институти (кундузги)",
    prof: "филолог, инглиз ва япон тили фани ўқитувчиси",
    information: `2004-2008 йй. - Самарқанд давлат чет тиллар институти, инглиз филологияси факультети
    2007-2008 йй. - Самарқанд тумани, 2-умумтаълим мактаби инглиз тили фани ўқитувчиси
    2008-2009 йй. - Самарқанд давлат архитектура ва қурилиш институти қошидаги 2-сон академик лицейда инглиз тили фани ўқитувчиси
    2009-2010 йй. - Маиший хизмат кўрсатиш тадбиркорлар уюшмасида инглиз тили  фани ўқитувчиси
    2011 йилдан буён – Самарқанд иқтисодиёт ва сервис институти академик лицейи инглиз тили фани ўқитувчиси`
  },
  {
    id: 40,
    img: "img/teachers_about/baxora teacher.jpg",
    name: "Курбонова Бахора Рустамовна",
    who: "Самарқанд туманидаги 2-ихтисослаштирилган давлат умумтаълим мактабида инглиз тили фани ўқитувчиси",
    thisdate: "2017йил  2-Сентябрдан:",
    borntime: "20. 03. 1987",
    bornplace: "Самарканд вилояти , Самарканд шахри",
    knowlege: "олий",
    knowpots: "йўқ",
    study: "2009 й. Самарқанд давлат чет тиллар институти(кундузги)",
    prof: "филолог, инглиз тили фани ўқитувчиси",
    information: `2009-2017йй.- Самарқанд туманидаги  17-МТМ нинг инлиз тили ўқитувчиси 
    2017йй.-ҳ.в.- Самарқанд туманидаги  2-ихтисослаштирилган давлат умумтаълим мактабда  инлиз тили ўқитувчиси `
  },
  {
    id: 41,
    img: "img/teachers_about/gulshoda techet.jpg",
    name: "Ирисқулова Гулшодa Жаҳангировна",
    who: "Самарқанд тумани 2-ихтисослаштирилган давлат умумимтаълим мактаби бошланғич синф ўқитувчиси ",
    thisdate: "2018йил 3-сентиябрдан:",
    borntime: "23.03.1976",
    bornplace: "Самарқанд вилояти, Нуробод тумани",
    knowlege: "олий",
    knowpots: "йўқ",
    study: "2018 йил, Самарқанд Давлат университети (кундузги)",
    prof: "бошланғич таълим ва спорт тарбиявий ишлар",
    information: `2014-2018 йй.- Самарқанд Давлат университети талабаси
    2018 й.   ҳ.в   .- Самарқанд тумани 2-ихтисослаштирилган давлат умум таълим мактаби бошланғич синф ўқитувчиси `
  }
]


// ==================================================================================  


let d = document
let burger_menu = d.querySelector('.burger_menu')
let to_top = d.querySelector('.to_top')
let burger = d.querySelector('.burger')
let burger_a = d.querySelectorAll('.burger a')
let modal_qabul = d.querySelector('.modal_qabul')
let btn_come = d.querySelectorAll('.come')
let modal_cross = d.querySelector('.modal_cross')
let grid_sec_three = d.querySelector('.grid_sec_three')
let teachers_modal = d.querySelector('.teachers_modal')
let modal_block_header = d.querySelector('.modal_block_header')
let sec_three_into = d.querySelector('.sec_three_into')
let btn_new = d.querySelector('.btn_new')
// import teachers_info from "./info.js"

AOS.init();

// burger menu
burger_menu.onclick = () => {
    burger_menu.classList.toggle('active')
    burger.classList.toggle('burger_active')
}
burger_a.forEach(elem => {
  elem.onclick = () => {
    burger.classList.remove('burger_active')
    burger_menu.classList.remove('active')
  }
});

window.addEventListener('scroll', () => {
  let scroll = d.querySelector('.to_top')
  scroll.classList.toggle('to_top_active', window.scrollY > 500)
})

function scrollToTop () {
  window.scrollTo({
    top: 0,
    behavior: "smooth"
  });

}
to_top.onclick = () => {
  scrollToTop()
}


for (let item of teachers_info) {
  let elem = d.createElement('div')
  grid_sec_three.appendChild(elem)

  let div = d.createElement('div')
  div.classList.add('elem_box')
  elem.appendChild(div)

  let img = d.createElement('img')
  img.src = item.img
  div.appendChild(img)

  let p = d.createElement('p')
  p.textContent = item.name
  div.appendChild(p)


  elem.onclick = () => {
    teachers_modal.classList.add('teachers_modal_active')
    d.body.style.overflow = 'hidden'

    let container = d.createElement('div')
    container.classList.add('container')
    teachers_modal.appendChild(container)

    let teachers_title = d.createElement('div')
    teachers_title.classList.add('teachers_title')
    container.appendChild(teachers_title)

    let teachers_title_h2 = d.createElement('h2')
    teachers_title_h2.textContent = "МАЪЛУМОТНОМА"
    teachers_title.appendChild(teachers_title_h2)

    let teachers_title_h3 = d.createElement('h3')
    teachers_title_h3.textContent = item.name
    teachers_title_h3.classList.add('name')
    teachers_title.appendChild(teachers_title_h3)

    let teacher_modal_intro = d.createElement('div')
    teacher_modal_intro.classList.add('teacher_modal_intro')
    container.appendChild(teacher_modal_intro)

    let intro_right = d.createElement('div')
    intro_right.classList.add('intro_right')
    teacher_modal_intro.appendChild(intro_right)

    let intro_right_img = d.createElement('img')
    intro_right_img.src = item.img
    intro_right.appendChild(intro_right_img)
    
    let intro_left = d.createElement('div')
    intro_left.classList.add('intro_left')
    teacher_modal_intro.appendChild(intro_left)

    let intro_left_title = d.createElement('div')
    intro_left_title.classList.add('intro_left_title')
    intro_left.appendChild(intro_left_title)

    let intro_left_title_p = d.createElement('p')
    intro_left_title_p.textContent = item.thisdate
    intro_left_title.appendChild(intro_left_title_p)

    let intro_left_title_h4 = d.createElement('h4')
    intro_left_title_h4.textContent = item.who
    intro_left_title.appendChild(intro_left_title_h4)

    let intro_left_info_block = d.createElement('div')
    intro_left_info_block.classList.add('intro_left_info_block')
    intro_left.appendChild(intro_left_info_block)

    let intro_left_born = d.createElement('div')
    intro_left_info_block.appendChild(intro_left_born)

    let intro_left_born_left = d.createElement('div')
    intro_left_born.appendChild(intro_left_born_left)

    let intro_left_born_left_h3 = d.createElement('h3')
    intro_left_born_left_h3.textContent = "Туғилган йили:"
    intro_left_born_left.appendChild(intro_left_born_left_h3)

    let intro_left_born_left_p = d.createElement('p')
    intro_left_born_left_p.textContent = item.borntime
    intro_left_born_left.appendChild(intro_left_born_left_p)

    let intro_left_born_right = d.createElement('div')
    intro_left_born.appendChild(intro_left_born_right)

    let intro_left_born_right_h3 = d.createElement('h3')
    intro_left_born_right_h3.textContent = "Туғилган жойи:"
    intro_left_born_right.appendChild(intro_left_born_right_h3)

    let intro_left_born_right_p = d.createElement('p')
    intro_left_born_right_p.textContent = item.bornplace
    intro_left_born_right.appendChild(intro_left_born_right_p)

    let intro_left_knowlege = d.createElement('div')
    intro_left_info_block.appendChild(intro_left_knowlege)

    let intro_left_knowlege_left = d.createElement('div')
    intro_left_knowlege.appendChild(intro_left_knowlege_left)

    let intro_left_knowlege_left_h3 = d.createElement('h3')
    intro_left_knowlege_left_h3.textContent = "Маълумоти:"
    intro_left_knowlege_left.appendChild(intro_left_knowlege_left_h3)

    let intro_left_knowlege_left_p = d.createElement('p')
    intro_left_knowlege_left_p.textContent = item.knowlege
    intro_left_knowlege_left.appendChild(intro_left_knowlege_left_p)

    let intro_left_knowlege_right = d.createElement('div')
    intro_left_knowlege.appendChild(intro_left_knowlege_right)

    let intro_left_knowlege_right_h3 = d.createElement('h3')
    intro_left_knowlege_right_h3.textContent = "Илмий даражаси:"
    intro_left_knowlege_right.appendChild(intro_left_knowlege_right_h3)

    let intro_left_knowlege_right_p = d.createElement('p')
    intro_left_knowlege_right_p.textContent = item.knowpots
    intro_left_knowlege_right.appendChild(intro_left_knowlege_right_p)

    let intro_left_center_box = d.createElement('div')
    intro_left.appendChild(intro_left_center_box)

    let intro_left_center = d.createElement('div')
    intro_left_center_box.appendChild(intro_left_center)

    let intro_left_center_h3 = d.createElement('h3')
    intro_left_center_h3.textContent = "Тамомлаган:"
    intro_left_center.appendChild(intro_left_center_h3)

    let intro_left_center_p = d.createElement('p')
    intro_left_center_p.textContent = item.study
    intro_left_center.appendChild(intro_left_center_p)

    let intro_left_center_sec = d.createElement('div')
    intro_left_center_box.appendChild(intro_left_center_sec)

    let intro_left_center_sec_h3 = d.createElement('h3')
    intro_left_center_sec_h3.textContent = "Маълумоти бўйича мутахассислиги:"
    intro_left_center_sec.appendChild(intro_left_center_sec_h3)

    let intro_left_center_sec_p = d.createElement('p')
    intro_left_center_sec_p.textContent = item.prof
    intro_left_center_sec.appendChild(intro_left_center_sec_p)

    let left_center_worked = d.createElement('div')
    left_center_worked.classList.add('left_center_worked')
    intro_left.appendChild(left_center_worked)

    let left_center_worked_h2 = d.createElement('h2')
    left_center_worked_h2.textContent = "МЕҲНАТ ФАОЛИЯТИ"
    left_center_worked.appendChild(left_center_worked_h2)

    let workerd_information = d.createElement('div')
    workerd_information.textContent = item.information
    left_center_worked.appendChild(workerd_information)



  }
  modal_block_header.onclick = () => {
    teachers_modal.classList.remove('teachers_modal_active')
    d.body.style.overflow = 'visible'
    window.location.reload()
  }
}

let currentIndex = 15;
function hideAllExceptFirst() {
    let allElements = grid_sec_three.querySelectorAll('.elem_box');
    for (let i = 0; i < allElements.length; i++) {
        if (i >= 15) {
            allElements[i].style.display = 'none';
        }
    }
}

hideAllExceptFirst();

function showRemainingElements() {
  let allElements = grid_sec_three.querySelectorAll('.elem_box');
  for (let i = currentIndex; i < allElements.length; i++) {
      allElements[i].style.display = 'grid';
  }
  currentIndex = allElements.length;

  if (currentIndex >= allElements.length) {
      btn_new.style.display = 'none';
  }
}

btn_new.addEventListener('click', showRemainingElements);


